# BuiltInFailures.SectionViewFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SectionViewFailures Members
BuiltInFailures..::..SectionViewFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SectionViewFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScopeBoxBehindSection | Section may not be associated to a scope box which lies behind it. |

# See Also
BuiltInFailures..::..SectionViewFailures Class
Autodesk.Revit.DB Namespace